[
  {
    "_id": "survey-data-entry",
    "title": "Survey Data Entry Assistant",
    "department": "Operations",
    "salary": "$2500 - $3500/M",
    "location": "Remote",
    "jobType": "Full Time",
    "experience": "Not required",
    "skills": ["Basic typing", "Attention to detail", "Ability to follow instructions", "Training will be provided"],
    "requirements": ["Must not be from Bangladesh or Pakistan", "Must complete Veriff identity verification", "Undergraduate degree preferred but not required"],
    "responsibilities": ["Input data from various survey platforms", "Perform basic quality checks", "Report formatting errors", "Maintain confidentiality of sensitive user data"],
    "hiring": 3,
    "shortDescription": "Help our team input survey responses from multiple sources into our database. No prior experience required.",
    "description": "We are seeking enthusiastic and detail-oriented individuals to support our growing survey operations team.<br/>In this role, you'll be responsible for accurately entering survey responses and interpreting hand-written or unstructured input into structured digital formats. Full training will be provided, so no prior experience is necessary.<br/><br/>You will also assist in performing routine quality checks to validate responses and flag inconsistencies or anomalies, escalating them to the QA lead where necessary. As part of a U.S.-based team, you're expected to communicate using our internal tools and comply with our Veriff identity verification process.<br/><br/>This is an excellent opportunity to gain foundational experience in data handling and operations, perfect for recent graduates or people looking to start their careers in tech or research."
  },
  {
    "_id": "survey-support-agent",
    "title": "Survey Support Agent",
    "department": "Customer Service",
    "salary": "$3000 - $4000/M",
    "location": "Remote",
    "jobType": "Full Time",
    "experience": "Not required",
    "skills": ["Fluent English", "Typing speed 40+ WPM", "Clear communication", "Training will be provided"],
    "requirements": ["Must not be from Bangladesh or Pakistan", "Must complete Veriff identity verification", "Strong internet connection"],
    "responsibilities": ["Respond to user queries via chat/email", "Assist users in understanding survey instructions", "Escalate complex issues to managers", "Maintain a helpful and professional tone"],
    "hiring": 3,
    "shortDescription": "Assist users via chat or email with survey-related queries. No experience needed.",
    "description": "Our survey platform is rapidly expanding, and we're looking for friendly and empathetic Support Agents to help users navigate and complete surveys seamlessly.<br/>You’ll engage with users through both chat and email, resolving common issues such as login problems, misunderstanding of survey instructions, and general platform inquiries. Don't worry—extensive training will be provided.<br/><br/>By working closely with an international team, you’ll learn best practices in customer service, ticket escalation workflows, and user satisfaction metrics. Your role will also help us gather user feedback to improve UX.<br/><br/>This position requires excellent written English, basic typing ability, and a desire to help others. Additional perks include flexible scheduling and performance-based bonuses."
  },
  {
    "_id": "form-checker",
    "title": "Survey Form Checker",
    "department": "Quality Assurance",
    "salary": "$2800 - $3200/M",
    "location": "Remote",
    "jobType": "Part Time",
    "experience": "Not required",
    "skills": ["Eye for detail", "Basic Excel/Google Sheets", "Can follow written guidelines", "Training will be provided"],
    "requirements": ["Must not be from Bangladesh or Pakistan", "Veriff verification required", "Must be available at least 20 hrs/week"],
    "responsibilities": ["Check completed survey forms for accuracy", "Ensure responses match expected logic", "Flag duplicate or spam entries", "Report to QA lead weekly"],
    "hiring": 3,
    "shortDescription": "Review completed surveys and flag inconsistencies. Perfect for recent graduates.",
    "description": "Join our Quality Assurance team and help ensure the integrity of survey data collected through our platform.<br/>As a Form Checker, you will review responses for em end and logic errors, flag suspicious or duplicated entries, and follow predefined criteria to verify consistency. You’ll use tools like Google Sheets or Excel, and detailed guidelines and training will be provided.<br/><br/>Working part-time, you’ll join weekly QA calls to review trends, common mistakes, and help drive improvements in the survey process. Your contributions will directly influence the reliability of our reports and user trust in the platform.<br/><br/>This position is ideal for individuals who are organized, meticulous, and enjoy independent work."
  },
  {
    "_id": "remote-survey-tester",
    "title": "Remote Survey Tester",
    "department": "Product Testing",
    "salary": "$3000 - $4500/M",
    "location": "Remote",
    "jobType": "Full Time",
    "experience": "Not required",
    "skills": ["Basic computer usage", "Patience with repetitive tasks", "Strong observational skills", "Training will be provided"],
    "requirements": ["Must not be from Bangladesh or Pakistan", "Veriff identity check is mandatory", "Laptop or PC with stable internet"],
    "responsibilities": ["Access survey links before public release", "Complete test surveys and note down issues", "Submit error reports through a form", "Communicate issues clearly to product team"],
    "hiring": 3,
    "shortDescription": "Test newly designed surveys for usability and bugs. No tech experience required.",
    "description": "We’re on the lookout for remote-ready individuals to test our survey builds before public launch.<br/>In this role, you will interact with live preview links of surveys to test for usability, flow, content clarity, and potential technical issues like broken skip logic or formatting errors. No coding experience is required—just attention to detail and patience.<br/><br/>You will complete assigned test scripts, record your findings using our internal bug tracking tool, and attend weekly review sessions with the product team to share insights. Training on survey logic, testing best practices, and reporting standards will be fully provided.<br/><br/>This role is perfect for those who enjoy being thorough, have reliable internet access, and want to learn how product QA works in a remote-first environment."
  },
  {
    "_id": "survey-email-handler",
    "title": "Survey Email Handler",
    "department": "Communications",
    "salary": "$2800 - $3800/M",
    "location": "Remote",
    "jobType": "Part Time",
    "experience": "Not required",
    "skills": ["Basic email management", "Google Workspace (Docs, Gmail)", "Typing and grammar skills", "Training will be provided"],
    "requirements": ["Not from Bangladesh or Pakistan", "Veriff verification required", "Must be organized and punctual"],
    "responsibilities": ["Check inbox daily", "Respond to emails using templates", "Flag messages needing supervisor review", "Forward critical feedback to product team"],
    "hiring": 3,
    "shortDescription": "Help sort and respond to email submissions from survey users. Simple and remote.",
    "description": "You'll support our survey operations by helping handle day-to-day email communications: filtering spam, categorizing emails, and sending templated responses.<br/>A structured training guide will teach you how to identify priority messages, use our Gmail+Sheets workflow, and provide helpful answers. You’ll collaborate closely with the communications lead to maintain tone and consistency across replies.<br/><br/>Your tasks include forwarding urgent feedback to teammates, recording common user issues in a shared doc, and ensuring timely responses. This part-time role is great for individuals with strong writing skills and solid time management habits."
  },
  {
    "_id": "us-based-field-agent",
    "title": "Onsite Survey Field Agent",
    "department": "Field Research",
    "salary": "$3500 - $5000/M",
    "location": "Austin, TX | Denver, CO | Miami, FL",
    "jobType": "Full Time",
    "experience": "Not required",
    "skills": ["People skills", "Comfort with public speaking", "Mobile device operation", "Training will be provided"],
    "requirements": ["U.S. resident (excluding Bangladesh and Pakistan nationals)", "No remote option for this role", "Must be willing to travel locally"],
    "responsibilities": ["Approach individuals for surveys", "Record survey responses accurately", "Report daily activity logs", "Follow ethical research practices"],
    "hiring": 3,
    "shortDescription": "Conduct in-person surveys in public areas. U.S. based only. Travel included.",
    "description": "Help us grow our survey footprint by collecting responses directly in your local area—malls, parks, campuses, and events.<br/>As an Onsite Field Agent, you'll be trained on proper approach techniques, ethical data collection standards, and mobile survey tools. No prior experience is needed, but confidence speaking with strangers and a reliable phone or tablet are essential.<br/><br/>You’ll maintain activity logs, submit daily progress reports, and escalate any challenges to your Field Supervisor. This role offers flexible scheduling and travel reimbursements within your region."
  },
  {
    "_id": "junior-uiux-designer",
    "title": "Junior UI/UX Designer",
    "department": "Design",
    "salary": "$3500 - $4800/M",
    "location": "Remote",
    "jobType": "Full Time",
    "experience": "0.6 - 1 year",
    "skills": ["Figma", "Canva", "Adobe XD or similar tools", "Basic understanding of HTML/CSS", "Training will be provided"],
    "requirements": ["Must not be from Bangladesh or Pakistan", "Bachelor’s degree (any field)", "Veriff verification required for remote workers"],
    "responsibilities": ["Design clean, functional interfaces", "Collaborate with devs on implementation", "Test usability of forms", "Suggest improvements based on user feedback"],
    "hiring": 3,
    "shortDescription": "Create simple and user-friendly interfaces for survey forms and dashboards. Ideal for fresh graduates.",
    "description": "Join our Product team as a Junior UI/UX Designer to help shape the look and feel of survey forms and dashboard panels.<br/>You’ll turn research insights and user feedback into clean mockups, wireframes, and clickable prototypes using Figma or Adobe XD. You’ll also partner with developers to ensure design fidelity in HTML/CSS builds.<br/><br/>We provide hands-on training in usability testing, layout best practices, and responsive design. During sprint planning, you'll learn to present your ideas and iterate based on stakeholder reviews.<br/><br/>This role is ideal for candidates with creative flair, basic design tool knowledge, and a willingness to learn user-centered design methodologies."
  },
  {
    "_id": "junior-web-developer",
    "title": "Junior Web Developer",
    "department": "Software",
    "salary": "$3800 - $5000/M",
    "location": "Remote",
    "jobType": "Full Time",
    "experience": "0.6 - 1 year",
    "skills": ["Basic HTML/CSS/JS", "Willingness to learn", "Git or version control basics", "Training will be provided"],
    "requirements": ["Must not be from Bangladesh or Pakistan", "Bachelor’s degree in STEM or coding bootcamp graduate", "Veriff verification required"],
    "responsibilities": ["Fix layout issues", "Implement small UI components", "Support senior devs in larger updates", "Document your code clearly"],
    "hiring": 3,
    "shortDescription": "Help maintain and improve our survey platform's front-end. Ideal for new grads.",
    "description": "We're looking for a Junior Web Developer to support our front-end development efforts on our survey platform.<br/>You’ll work under senior developer mentorship, tackling tasks like fixing layout bugs, adding UI components, optimizing page performance, and ensuring mobile responsiveness.<br/><br/>You'll collaborate through Git branches, code reviews, and sprint planning, gaining hands-on experience with best practices in clean, maintainable code. Training and continued guidance will help you grow technical skills rapidly.<br/><br/>This is a full-time remote role—ideal for recent graduates or bootcamp grads ready to launch their dev careers."
  },
  {
    "_id": "junior-sysadmin",
    "title": "Junior System Administrator (Network Support)",
    "department": "IT Support",
    "salary": "$4000 - $5500/M",
    "location": "Remote or NYC Office",
    "jobType": "Full Time",
    "experience": "0.6 - 1 year",
    "skills": ["Basic networking knowledge", "Windows/Linux familiarity", "VPN usage", "Google Workspace or MS365", "Training will be provided"],
    "requirements": ["Must not be from Bangladesh or Pakistan", "Bachelor’s in Computer Science, IT, or related field", "Veriff ID check required for remote"],
    "responsibilities": ["Handle user access requests", "Monitor system/network dashboards", "Perform basic server restarts", "Escalate complex issues to senior IT staff"],
    "hiring": 3,
    "shortDescription": "Monitor server uptime, VPN access, and network health. Entry-level tech position.",
    "description": "In the Junior System Administrator role, you’ll help keep our survey platform’s infrastructure healthy—monitoring servers, network status, VPN connections, and user access.<br/>You’ll handle user onboarding and offboarding, troubleshoot minor access or connectivity issues, and perform routine maintenance tasks. Training includes server basics, cloud platform overviews, and IT ticketing procedures.<br/><br/>If based remotely, you'll work under Veriff verification to ensure security compliance. Onsite, you'll assist the NYC IT team.<br/><br/>This opening is perfect for early-career IT professionals looking to build foundational sysadmin experience."
  },
  {
    "_id": "social-media-assistant",
    "title": "Social Media Assistant",
    "department": "Marketing",
    "salary": "$3200 - $4200/M",
    "location": "Remote",
    "jobType": "Full Time",
    "experience": "Not required",
    "skills": ["Basic Canva or graphic tools", "Social media app familiarity", "Good writing skills", "Training will be provided"],
    "requirements": ["Must not be from Bangladesh or Pakistan", "Veriff verification mandatory", "Undergraduate degree (any field)"],
    "responsibilities": ["Schedule 1-2 posts/day", "Respond to comments & DMs", "Monitor engagement metrics", "Help brainstorm post ideas"],
    "hiring": 3,
    "shortDescription": "Manage and schedule content across Instagram, LinkedIn, and X. No experience needed.",
    "description": "We’re hiring a Social Media Assistant to grow our presence across Instagram, LinkedIn, and X (formerly Twitter).<br/>Your responsibilities include scheduling regular posts, monitoring comments and direct messages, tracking engagement metrics, and assisting with simple graphics using Canva.<br/><br/>All tools and social media strategy training will be provided. You’ll also participate in content brainstorming sessions and get exposure to social campaign planning.<br/><br/>This role is perfect for creative undergrads who enjoy writing and visual storytelling online."
  },
  {
    "_id": "customer-service-representative",
    "title": "Customer Service Representative",
    "department": "Support",
    "salary": "$3000 - $4300/M",
    "location": "Remote",
    "jobType": "Full Time",
    "experience": "Not required",
    "skills": ["Fluent English", "Typing skills", "Empathy and professionalism", "Training will be provided"],
    "requirements": ["Must not be from Bangladesh or Pakistan", "Must complete Veriff verification", "Any undergraduate degree or diploma"],
    "responsibilities": ["Respond to customer queries", "Escalate technical issues", "Track FAQs and recurring issues", "Maintain friendly tone"],
    "hiring": 3,
    "shortDescription": "Answer emails and live chats from survey users. No prior experience needed.",
    "description": "We're looking for a Customer Service Representative to support our users over live chat and email.<br/>You’ll work from prepared scripts and receive in-depth training on handling technical issues, billing questions, and user feedback. Empathy and professionalism are essential.<br/><br/>You'll also log recurring questions to help build our FAQ knowledge base and escalate complex issues to senior support or technical teams.<br/><br/>This is a fully remote, beginner-friendly position with significant room for advancement into senior support or community liaison roles."
  }
]
